# Colon12 Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..Colon12 Property
SymbolTypeId Class See Also
---
Symbol :12, indicating unit Ratio : 12.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Colon12 { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Colon12 As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Colon12 {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace